[
    {
      "title": "Leprechaun’s Gold and the Rainbow",
      "text": "Long ago, in the green fields of Ireland, a farmer named Seamus stumbled upon a tiny figure dressed in green, hammering away at a tiny shoe under an ancient oak tree. Knowing the old tales, Seamus realized he had caught a leprechaun. \n\n“Release me, and I’ll tell you where me gold is hidden!” the leprechaun pleaded.\n\n Seamus, being a clever man, held tight to the creature and demanded to know the location of the treasure. The leprechaun pointed toward a rainbow shining in the distance. “It’s at the end of that rainbow. But ye must hurry, for it won’t stay forever.”\n\n Eager, Seamus grabbed a sack and ran toward the glowing colors. But just as he reached out, the rainbow flickered and disappeared. When he turned back, the leprechaun was gone, cackling in the wind. To this day, no one has ever reached the end of the rainbow—except, perhaps, the leprechauns themselves.",
      "wisdom": "Gold may shine bright, but the real treasure is knowing when to chase it and when to let it be.",
      "imagePath": "assets/images/legends/1.png"
    },
    {
      "title": "The Curse of the Clonfinlough Hoard",
      "text": "In the rolling fields of Clonfinlough, a farmer named Padraig unearthed a collection of golden torcs and brooches while plowing his land. That night, an eerie green light surrounded his cottage, and whispers echoed through the fields. \n\nBy morning, Padraig’s cattle had fallen ill, his crops had withered, and strange shadows moved within his home. Desperate, he sought help from a local priest. The priest examined the gold and gasped, “These belong to the Fair Folk. They don’t take kindly to thieves.” Fearing the wrath of the ancient spirits, Padraig returned the treasure to the earth and whispered an apology. The next day, the whispers stopped, the light vanished, and his luck returned. But no one has dared to dig there again.",
      "wisdom": "Not all treasure is meant to be taken—some is best left where it lies.",
      "imagePath": "assets/images/legends/2.png"
    },
    {
      "title": "Banshee – The Ghostly Harbinger of Fate",
      "text": "A chilling wind swept through the O’Connor estate on a moonless night. As young Maeve sat by the window, she heard it—the sorrowful wail of a woman, drifting through the hills like a song of mourning.\n\n Terrified, she woke her father. “The banshee cries for us,” he whispered, his face pale. “Someone in our family will not see another sunrise.”\n\n The next morning, a rider arrived with grim news—Maeve’s uncle had passed away in his sleep. From that day on, the O’Connors knew the banshee’s wail was no mere legend, but a forewarning of fate itself.",
      "wisdom": "If the wind carries a woman’s wail at night, listen well—it may be the voice of destiny.",
      "imagePath": "assets/images/legends/3.png"
    },
    {
      "title": "Giant Finn McCool and the Giant’s Causeway",
      "text": "Finn McCool, the mightiest giant of Ireland, long feuded with the Scottish giant, Benandonner. One day, Finn built a bridge of stones across the sea to reach Scotland and settle the score.\n\n But as he neared, he saw the true size of his rival—Benandonner was a mountain of a man, towering over any foe. Thinking quickly, Finn raced home and had his wife disguise him as a baby in a cradle.\n\n When Benandonner arrived and saw the “child,” he paled. “If their babies are this size, what must their warriors be like?” Overcome with fear, he fled back to Scotland, tearing apart the causeway behind him. And thus, the Giant’s Causeway was born.",
      "wisdom": "Sometimes, the smartest way to win a fight is to never throw a punch at all.",
      "imagePath": "assets/images/legends/4.png"
    },
    {
      "title": "The Tuatha Dé Danann – The Mysterious People of the Gods",
      "text": "A long time ago, a mist rolled over Ireland, and from it emerged the Tuatha Dé Danann—beings of wisdom and power. They wielded four sacred treasures: the Stone of Fal, the Spear of Lugh, the Sword of Light, and the Cauldron of Plenty.\n\n For many years, they ruled, but as time passed, men grew strong and numerous. Rather than fight, the Tuatha Dé Danann vanished into the hills and mounds, becoming the fairies and spirits of the land.\n\n Some say they still dwell beneath Ireland, watching, waiting. If you leave a gift at a fairy ring, you may yet feel their magic.",
      "wisdom": "The past is never truly gone—listen to the whispers in the hills, and you may learn its secrets.",
      "imagePath": "assets/images/legends/5.png"
    },
    {
      "title": "The Black Horse of the Dullahan – The Headless Rider",
      "text": "On moonlit nights, a headless rider gallops through the Irish countryside, his black horse breathing fire, his severed head glowing like a lantern.\n\n The Dullahan does not speak, but when he stops, a name is whispered on the wind—the name of someone who will soon perish.\n\n If you ever see him, do not watch, do not listen. For those who do may find their own name spoken next.",
      "wisdom": "If the rider comes, turn away—for curiosity may cost more than gold.",
      "imagePath": "assets/images/legends/6.png"
    },
    {
      "title": "O’Donnell and the Golden Gauntlet",
      "text": "O’Donnell was a bold warrior who once received a golden gauntlet from the fairies, granting him victory in battle. But greed took root in his heart.\n\n Determined to steal more from the fairies, he ventured into their hidden halls. But as soon as he touched another treasure, the walls shook, and the world around him vanished.\n\n His soul was cursed to wander the hills, forever seeking the gauntlet he lost.",
      "wisdom": "A gift freely given is a blessing; a treasure stolen is a curse.",
      "imagePath": "assets/images/legends/7.png"
    },
    {
      "title": "The Enchanted Lake of Loch Derg",
      "text": "Deep beneath the waters of Loch Derg lies a chest filled with nine golden coins. Many have tried to retrieve it, but none have returned the same.\n\n A fisherman once claimed he touched the chest, but as soon as he did, the water turned to mist, and he saw his greatest fears staring back at him. When he awoke on the shore, his hair had turned white, and he never spoke of what he saw.\n\n The lake still holds its secret, waiting for the next fool to try.",
      "wisdom": "Some treasures are guarded not by locks, but by the fears within your own heart.",
      "imagePath": "assets/images/legends/8.png"
    },
    {
      "title": "The Leprechaun and the Magic Shoes",
      "text": "Seamus, a poor cobbler, once stole a single enchanted shoe from a leprechaun, hoping it would lead him to gold.\n\n At first, luck smiled on him—his business flourished, and his pockets jingled with coin. But soon, misfortune followed. His tools broke, his house creaked in the night, and whispers filled his shop.\n\n One morning, he found the shoe missing, and in its place, a note: “A cobbler should know—take one shoe, and ye’ll always be off balance.”",
      "wisdom": "If you steal from a leprechaun, be ready to dance to his tune.",
      "imagePath": "assets/images/legends/9.png"
    }
  ]
  